app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2022-06-02 01:19:47.505048"], ["id", 46]]